IRP/src/Enums/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ItemTypes</name>
 <enumValues>
  <name>Service</name>
 </enumValues>
 <enumValues>
  <name>Product</name>
 </enumValues>
 <enumValues>
  <name>Certificate</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItemKeys</name>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>Specification</name>
    <type>
      <types>CatalogRef.Specifications</types>
    </type>
  </attributes>
  <attributes>
    <name>AffectPricingMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UniqueMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ItemKeyID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DefaultBillOfMaterials</name>
    <type>
      <types>CatalogRef.BillOfMaterials</types>
    </type>
  </attributes>
  <attributes>
    <name>UseIncomingStockReservation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PackageUnit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>SearchLiteral</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SpecificationAffectPricingMD5</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>AffectPricingMD5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Items</name>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>CatalogRef.ItemTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>MainPricture</name>
    <comment>Temporary</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PackageUnit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/CatItemsServer/Module.bsl
Function GetItemKeyByItem(Item) Export
	Return Catalogs.ItemKeys.GetUniqueItemKeyByItem(Item);
EndFunction

Function GetArrayOfItemKeysByItem(Item) Export
	Return Catalogs.Items.GetArrayOfItemKeysByItem(Item);
EndFunction

Function GetItemKeyUnit(Val ItemKey) Export
	ItemKeyUnit = ItemKey.Unit;
	If Not ValueIsFilled(ItemKeyUnit) And ValueIsFilled(ItemKey.Item) Then
		Return ItemKey.Item.Unit;
	EndIf;
	Return ItemKeyUnit;
EndFunction

Function StoreMustHave(Value) Export

	If Not ValueIsFilled(Value) Then
		Return True;
	EndIf;

	If TypeOf(Value) = Type("CatalogRef.Items") Then
		Return Not Value.ItemType.Type = PredefinedValue("Enum.ItemTypes.Service");
	ElsIf TypeOf(Value) = Type("CatalogRef.ItemKeys") Then
		Return Not Value.Item.ItemType.Type = PredefinedValue("Enum.ItemTypes.Service");
	ElsIf TypeOf(Value) = Type("CatalogRef.ItemTypes") Then
		Return Not Value.Type = PredefinedValue("Enum.ItemTypes.Service");
	Else
		Return False;
	EndIf;

EndFunction
